wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_i3c.h
/*
 *******************************************************************************
    @file     reg_i3c.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_I3C_H
#define __REG_I3C_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#if 0
/* IP_DesignSpec_I3C_V0.2 */
#endif


#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif



/**
  * @brief I3C Base Address Definition
  */
#define I3C1_BASE                       (APB1PERIPH_BASE + 0xA000)              /*!< Base Address: 0x4000A000 */

/**
  * @brief I3C Register Structure Definition
  */
typedef struct {
    __IO uint32_t RESERVED0x00;                                                 /*!< Reserved Register                  offset: 0x00 */
    __IO uint32_t CONFIG;                                                       /*!< Configuration register             offset: 0x04 */
    __IO uint32_t STATUS;                                                       /*!< Status register                    offset: 0x08 */
    __IO uint32_t CTRL;                                                         /*!< Control register                   offset: 0x0C */
    __IO uint32_t INTSET;                                                       /*!< Interrupt enable register          offset: 0x10 */
    __IO uint32_t INTCLR;                                                       /*!< Clear interrupt-enable register    offset: 0x14 */
    __IO uint32_t INTMSK;                                                       /*!< Interrupt mask register            offset: 0x18 */
    __IO uint32_t ERRWARN;                                                      /*!< Error warning register             offset: 0x1C */
    __IO uint32_t DMACTRL;                                                      /*!< DMA control register               offset: 0x20 */
    __IO uint32_t RESERVED0x24[2];                                              /*!< Reserved Register                  offset: 0x24 */
    __IO uint32_t DATACTRL;                                                     /*!< Data control register              offset: 0x2C */
    __IO uint32_t WDATAB;                                                       /*!< Write bytes register               offset: 0x30 */
    __IO uint32_t WDATABE;                                                      /*!< Write the final byte register      offset: 0x34 */
    __IO uint32_t WDATAH;                                                       /*!< Write a half-word register         offset: 0x38 */
    __IO uint32_t WDATAHE;                                                      /*!< Write the final half-word register offset: 0x3C */
    __IO uint32_t RDATAB;                                                       /*!< Read bytes register                offset: 0x40 */
    __IO uint32_t RESERVED0x44;                                                 /*!< Reserved Register                  offset: 0x44 */
    __IO uint32_t RDATAH;                                                       /*!< Read half-word register            offset: 0x48 */
    __IO uint32_t RESERVED0x4C[2];                                              /*!< Reserved Register                  offset: 0x4C~0x50 */
    __IO uint32_t WDATAB1;                                                      /*!< Only write bytes register          offset: 0x54 */
    __IO uint32_t RESERVED0x58;                                                 /*!< Reserved Register                  offset: 0x58 */
    __IO uint32_t CAPABILITIES2;                                                /*!< Functional information register2   offset: 0x5C */
    __IO uint32_t CAPABILITIES;                                                 /*!< Functional information register    offset: 0x60 */
    __IO uint32_t DYNADDR;                                                      /*!< Dynamic address register           offset: 0x64 */
    __IO uint32_t MAXLIMITS;                                                    /*!< Max. limit register                offset: 0x68 */
    __IO uint32_t IDPARTNO;                                                     /*!< Product model number id register   offset: 0x6C */
    __IO uint32_t IDEXT;                                                        /*!< Id component register              offset: 0x70 */
    __IO uint32_t VENDORID;                                                     /*!< Supplier id register               offset: 0x74 */
    __IO uint32_t RESERVED0x78[98];                                             /*!< Reserved Register                  offset: 0x78~0x1FC */
    __IO uint32_t DIV;                                                          /*!< Frequency division Register        offset: 0x200 */
    __IO uint32_t SPKLEN;                                                       /*!< Filter register                    offset: 0x204 */
} I3C_TypeDef;



/**
  * @brief I3C type pointer Definition
  */
#define I3C1                            ((I3C_TypeDef*)I3C1_BASE)

/**
  * @brief I3C_CONFIG Register Bit Definition
  */
#define I3C_CONFIG_SLVENA_Pos           (0)
#define I3C_CONFIG_SLVENA               (0x01U << I3C_CONFIG_SLVENA_Pos)        /*!< I3C enable */
#define I3C_CONFIG_NACK_Pos             (1)
#define I3C_CONFIG_NACK                 (0x01U << I3C_CONFIG_NACK_Pos)          /*!< Slave does not respond to all requests except the CCC broadcast */
#define I3C_CONFIG_MATCHSS_Pos          (2)
#define I3C_CONFIG_MATCHSS              (0x01U << I3C_CONFIG_MATCHSS_Pos)       /*!< The START and STOP state bits are setted only if the STATUS.MATCHED is setted */
#define I3C_CONFIG_S0IGNORE_Pos         (3)
#define I3C_CONFIG_S0IGNORE             (0x01U << I3C_CONFIG_S0IGNORE_Pos)      /*!< The s0 or s1 errors are not detected */

#define I3C_CONFIG_IDRAND_Pos           (8)
#define I3C_CONFIG_IDRAND               (0x01U << I3C_CONFIG_IDRAND_Pos)        /*!< The bit 32 of the 48-bit PID indicates that the value of the partno register is random */
#define I3C_CONFIG_OFFLINE_Pos          (9)
#define I3C_CONFIG_OFFLINE              (0x01U << I3C_CONFIG_OFFLINE_Pos)       /*!< Rejoin the i3c bus with the existing dynamic address */

#define I3C_CONFIG_BAMATCH_Pos          (16)
#define I3C_CONFIG_BAMATCH              (0xFFU << I3C_CONFIG_BAMATCH_Pos)       /*!< Configure count value */

#define I3C_CONFIG_SADDR_Pos            (25)
#define I3C_CONFIG_SADDR                (0x7FU << I3C_CONFIG_SADDR_Pos)         /*!< Set the i2c 7-bit static address */

/**
  * @brief I3C_STATUS Register Bit Definition
  */
#define I3C_STATUS_STNOTSTOP_Pos        (0)
#define I3C_STATUS_STNOTSTOP            (0x01U << I3C_STATUS_STNOTSTOP_Pos)     /*!< I3C Bus busy (active), or this device detected s0 / s1 error waiting for HDR exit mode. */
#define I3C_STATUS_STMSG_Pos            (1)
#define I3C_STATUS_STMSG                (0x01U << I3C_STATUS_STMSG_Pos)         /*!< Listening to or responding to the bus */
#define I3C_STATUS_STCCCH_Pos           (2)
#define I3C_STATUS_STCCCH               (0x01U << I3C_STATUS_STCCCH_Pos)        /*!< Automating the ccc */
#define I3C_STATUS_STREQRD_Pos          (3)
#define I3C_STATUS_STREQRD              (0x01U << I3C_STATUS_STREQRD_Pos)       /*!< The current bus request is an SDR mode read (bus reads the data from this device), or if the device is sending an IBI. */
#define I3C_STATUS_STREQWR_Pos          (4)
#define I3C_STATUS_STREQWR              (0x01U << I3C_STATUS_STREQWR_Pos)       /*!< The bus is in ENTDAA mode (whether I3C has dynamic address or not) */
#define I3C_STATUS_STDAA_Pos            (5)
#define I3C_STATUS_STDAA                (0x01U << I3C_STATUS_STDAA_Pos)         /*!< Target address for master mode */
#define I3C_STATUS_STHDR_Pos            (6)
#define I3C_STATUS_STHDR                (0x01U << I3C_STATUS_STHDR_Pos)         /*!< The bus is in HDR mode */

#define I3C_STATUS_START_Pos            (8)
#define I3C_STATUS_START                (0x01U << I3C_STATUS_START_Pos)         /*!< The bus is detected to have a START or RESTART condition write 1 reset since the last time. */
#define I3C_STATUS_MATCHED_Pos          (9)
#define I3C_STATUS_MATCHED              (0x01U << I3C_STATUS_MATCHED_Pos)       /*!< Since the last time the bit was cleared, the incoming address matches the I3C dynamic or I2C static address of this device. */
#define I3C_STATUS_STOP_Pos             (10)
#define I3C_STATUS_STOP                 (0x01U << I3C_STATUS_STOP_Pos)          /*!< A STOP has been detected on the bus since the last time the bit was cleared (the STNOTSTOP bit indicates whether the bus is currently stopped). */
#define I3C_STATUS_RXPEND_Pos           (11)
#define I3C_STATUS_RXPEND               (0x01U << I3C_STATUS_RXPEND_Pos)        /*!< Received data available */
#define I3C_STATUS_TXNOTFULL_Pos        (12)
#define I3C_STATUS_TXNOTFULL            (0x01U << I3C_STATUS_TXNOTFULL_Pos)     /*!< The TX FIFO can accept more data */
#define I3C_STATUS_DACHG_Pos            (13)
#define I3C_STATUS_DACHG                (0x01U << I3C_STATUS_DACHG_Pos)         /*!< Dynamic addresses change when they are assigned, reassigned, or reset (lost). */
#define I3C_STATUS_CCC_Pos              (14)
#define I3C_STATUS_CCC                  (0x01U << I3C_STATUS_CCC_Pos)           /*!< The I3C received from the device could not automatically process the CCC. */
#define I3C_STATUS_ERRWARN_Pos          (15)
#define I3C_STATUS_ERRWARN              (0x01U << I3C_STATUS_ERRWARN_Pos)       /*!< An error or warning has occurred; see the ERRWARN register for details */

#define I3C_STATUS_CHANDLED_Pos         (17)
#define I3C_STATUS_CHANDLED             (0x01U << I3C_STATUS_CHANDLED_Pos)      /*!< The I3C slave device has handled the CCC */
#define I3C_STATUS_EVENT_Pos            (18)
#define I3C_STATUS_EVENT                (0x01U << I3C_STATUS_EVENT_Pos)         /*!< An IBI, MR, or Hot-Join has been requested */

#define I3C_STATUS_EVDET_Pos            (20)
#define I3C_STATUS_EVDET                (0x03U << I3C_STATUS_EVDET_Pos)         /*!< Status of the current (EVENT is 1) or pending event */

#define I3C_STATUS_IBIDIS_Pos           (24)
#define I3C_STATUS_IBIDIS               (0x01U << I3C_STATUS_IBIDIS_Pos)        /*!< The IBI is forbidden by the I3C bus controller via DISEC CCC */
#define I3C_STATUS_MRDIS_Pos            (25)
#define I3C_STATUS_MRDIS                (0x01U << I3C_STATUS_MRDIS_Pos)         /*!< The bus controller request is forbidden by the I3C bus controller via DISEC CCC */

#define I3C_STATUS_HJDIS_Pos            (27)
#define I3C_STATUS_HJDIS                (0x03FFU << I3C_STATUS_HJDIS_Pos)       /*!< Hot-Join is forbidden by the I3C bus controller via DISEC CCC */

#define I3C_STATUS_ACTSTATE_Pos         (28)
#define I3C_STATUS_ACTSTATE             (0x03U << I3C_STATUS_ACTSTATE_Pos)      /*!< The active state set by the I3C bus controller via ENTASn CCC */

/**
  * @brief I3C_CTRL Register Bit Definition
  */
#define I3C_CTRL_EVENT_Pos              (0)
#define I3C_CTRL_EVENT                  (0x03U << I3C_CTRL_EVENT_Pos)           /*!< Setting it to a value other than 0 will request an event: */

#define I3C_CTRL_EXTDATA_Pos            (3)
#define I3C_CTRL_EXTDATA                (0x01U << I3C_CTRL_EXTDATA_Pos)         /*!< After the IBI sends the IBIDATA, it continues to send extended data from the Tx FIFO. */

#define I3C_CTRL_IBIDATA_Pos            (8)
#define I3C_CTRL_IBIDATA                (0xFFU << I3C_CTRL_IBIDATA_Pos)         /*!< The IBI payload data bytes. */

