wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_i3c.h
#define I3C_CTRL_PENDINT_Pos            (16)
#define I3C_CTRL_PENDINT                (0x0FU << I3C_CTRL_PENDINT_Pos)         /*!< Configure the return value of the Pending Interrupt field of the GETSTATUS CCC command. */
#define I3C_CTRL_ACTSTATE_Pos           (20)
#define I3C_CTRL_ACTSTATE               (0x03U << I3C_CTRL_ACTSTATE_Pos)        /*!< Configure the Activity state of the device as the return value of the Activity Mode field of the GETSTATUS CCC command. */

#define I3C_CTRL_VENDINFO_Pos           (24)
#define I3C_CTRL_VENDINFO               (0xFFU << I3C_CTRL_VENDINFO_Pos)        /*!< The returned value of the Vendor Reserved field of the GETSTATUS CCC command is specified. */

/**
  * @brief I3C_INTSET Register Bit Definition
  */
#define I3C_INTSET_START_Pos            (8)
#define I3C_INTSET_START                (0x01U << I3C_INTSET_START_Pos)         /*!< The START/RESTART condition of the bus was detected. Procedure */
#define I3C_INTSET_MATCHED_Pos          (9)
#define I3C_INTSET_MATCHED              (0x01U << I3C_INTSET_MATCHED_Pos)       /*!< Dynamic or static address matching interruption was enabled */
#define I3C_INTSET_STOP_Pos             (10)
#define I3C_INTSET_STOP                 (0x01U << I3C_INTSET_STOP_Pos)          /*!< The interrupt condition of bus STOP was detected */
#define I3C_INTSET_RXPEND_Pos           (11)
#define I3C_INTSET_RXPEND               (0x01U << I3C_INTSET_RXPEND_Pos)        /*!< Enable the receiving interrupt */
#define I3C_INTSET_TXSEND_Pos           (12)
#define I3C_INTSET_TXSEND               (0x01U << I3C_INTSET_TXSEND_Pos)        /*!< Data sending (read) interruption is enabled */
#define I3C_INTSET_DACHG_Pos            (13)
#define I3C_INTSET_DACHG                (0x01U << I3C_INTSET_DACHG_Pos)         /*!< Disable dynamic address change (caused by SETDASA, ENTDAA, or RSTDAA) */
#define I3C_INTSET_CCC_Pos              (14)
#define I3C_INTSET_CCC                  (0x01U << I3C_INTSET_CCC_Pos)           /*!< CCC receive interrupt function enable */
#define I3C_INTSET_ERRWARN_Pos          (15)
#define I3C_INTSET_ERRWARN              (0x01U << I3C_INTSET_ERRWARN_Pos)       /*!< Error/Warning Interrupt enable */

#define I3C_INTSET_CHANDLED_Pos         (17)
#define I3C_INTSET_CHANDLED             (0x01U << I3C_INTSET_CHANDLED_Pos)      /*!< The CCC process is complete. The interrupt function is enabled */
#define I3C_INTSET_EVENT_Pos            (18)
#define I3C_INTSET_EVENT                (0x01U << I3C_INTSET_EVENT_Pos)         /*!< The event request (IBI, MR, or Hot-Join) interruption function was enabled */

/**
  * @brief I3C_INTCLR Register Bit Definition
  */
#define I3C_INTCLR_START_Pos            (8)
#define I3C_INTCLR_START                (0x01U << I3C_INTCLR_START_Pos)         /*!< Clear START bit and disable the corresponding interrupt source */
#define I3C_INTCLR_MATCHED_Pos          (9)
#define I3C_INTCLR_MATCHED              (0x01U << I3C_INTCLR_MATCHED_Pos)       /*!< Clear MATCHED bit and disable the corresponding interrupt source */
#define I3C_INTCLR_STOP_Pos             (10)
#define I3C_INTCLR_STOP                 (0x01U << I3C_INTCLR_STOP_Pos)          /*!< Clear STOP bit and disable the corresponding interrupt source */
#define I3C_INTCLR_RXPEND_Pos           (11)
#define I3C_INTCLR_RXPEND               (0x01U << I3C_INTCLR_RXPEND_Pos)        /*!< Clear RXPEND bit and disable the corresponding interrupt source */
#define I3C_INTCLR_TXSEND_Pos           (12)
#define I3C_INTCLR_TXSEND               (0x01U << I3C_INTCLR_TXSEND_Pos)        /*!< Clear TXSEND bit and disable the corresponding interrupt source */
#define I3C_INTCLR_DACHG_Pos            (13)
#define I3C_INTCLR_DACHG                (0x01U << I3C_INTCLR_DACHG_Pos)         /*!< Clear DACHG bit and disable the corresponding interrupt source */
#define I3C_INTCLR_CCC_Pos              (14)
#define I3C_INTCLR_CCC                  (0x01U << I3C_INTCLR_CCC_Pos)           /*!< Clear CCC bit and disable the corresponding interrupt source */
#define I3C_INTCLR_ERRWARN_Pos          (15)
#define I3C_INTCLR_ERRWARN              (0x01U << I3C_INTCLR_ERRWARN_Pos)       /*!< Clear ERRWARN bit and disable the corresponding interrupt source */

#define I3C_INTCLR_CHANDLED_Pos         (17)
#define I3C_INTCLR_CHANDLED             (0x01U << I3C_INTCLR_CHANDLED_Pos)      /*!< Clear CHANDLED bit and disable the corresponding interrupt source */
#define I3C_INTCLR_EVENT_Pos            (18)
#define I3C_INTCLR_EVENT                (0x01U << I3C_INTCLR_EVENT_Pos)         /*!< Clear EVENT bit and disable the corresponding interrupt source */

/**
  * @brief I3C_INTMASKED Register Bit Definition
  */
#define I3C_INTMASKED_START_Pos         (8)
#define I3C_INTMASKED_START             (0x01U << I3C_INTMASKED_START_Pos)      /*!< START interrupt status bit */
#define I3C_INTMASKED_MATCHED_Pos       (9)
#define I3C_INTMASKED_MATCHED           (0x01U << I3C_INTMASKED_MATCHED_Pos)    /*!< MATCHED interrupt status bit */
#define I3C_INTMASKED_STOP_Pos          (10)
#define I3C_INTMASKED_STOP              (0x01U << I3C_INTMASKED_STOP_Pos)       /*!< STOP interrupt status bit */
#define I3C_INTMASKED_RXPEND_Pos        (11)
#define I3C_INTMASKED_RXPEND            (0x01U << I3C_INTMASKED_RXPEND_Pos)     /*!< RXPEND interrupt status bit */
#define I3C_INTMASKED_TXSEND_Pos        (12)
#define I3C_INTMASKED_TXSEND            (0x01U << I3C_INTMASKED_TXSEND_Pos)     /*!< TXSEND interrupt status bit */
#define I3C_INTMASKED_DACHG_Pos         (13)
#define I3C_INTMASKED_DACHG             (0x01U << I3C_INTMASKED_DACHG_Pos)      /*!< DACHG interrupt status bit */
#define I3C_INTMASKED_CCC_Pos           (14)
#define I3C_INTMASKED_CCC               (0x01U << I3C_INTMASKED_CCC_Pos)        /*!< CCC interrupt status bit */
#define I3C_INTMASKED_ERRWARN_Pos       (15)
#define I3C_INTMASKED_ERRWARN           (0x01U << I3C_INTMASKED_ERRWARN_Pos)    /*!< ERRWARN interrupt status bit */

#define I3C_INTMASKED_CHANDLED_Pos      (17)
#define I3C_INTMASKED_CHANDLED          (0x01U << I3C_INTMASKED_CHANDLED_Pos)   /*!< CHANDLED interrupt status bit */
#define I3C_INTMASKED_EVENT_Pos         (18)
#define I3C_INTMASKED_EVENT             (0x01U << I3C_INTMASKED_EVENT_Pos)      /*!< EVENT interrupt status bit */

/**
  * @brief I3C_ERRWARN Register Bit Definition
  */
#define I3C_ERRWARN_ORUN_Pos            (0)
#define I3C_ERRWARN_ORUN                (0x01U << I3C_ERRWARN_ORUN_Pos)         /*!< The application failed to read the send data in time, resulting in a FIFO overflow */

