wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_i3c.h
#define I3C_ERRWARN_URUN_Pos            (1)
#define I3C_ERRWARN_URUN                (0x01U << I3C_ERRWARN_URUN_Pos)         /*!< The application failed to provide send data in a timely manner, resulting in an underload of the FIFO */
#define I3C_ERRWARN_URUNNACK_Pos        (2)
#define I3C_ERRWARN_URUNNACK            (0x01U << I3C_ERRWARN_URUNNACK_Pos)     /*!< The FIFO is underloaded when receiving the address of the read command, so the I3C slave device does not respond (NACK) to the address */
#define I3C_ERRWARN_TERM_Pos            (3)
#define I3C_ERRWARN_TERM                (0x01U << I3C_ERRWARN_TERM_Pos)         /*!< The I3C bus controller terminates the read before the I3C sends data from the device to END */
#define I3C_ERRWARN_INVSTART_Pos        (4)
#define I3C_ERRWARN_INVSTART            (0x01U << I3C_ERRWARN_INVSTART_Pos)     /*!< Invalid START condition occurs (SCL drops when SDA is high under STOP condition) */

#define I3C_ERRWARN_SPAR_Pos            (8)
#define I3C_ERRWARN_SPAR                (0x01U << I3C_ERRWARN_SPAR_Pos)         /*!< The SDR message sent by the I3C controller has a parity error. Or the bus controller fails to drive the clock over 100us during SDR Read, resulting in read abort (timeout) */
#define I3C_ERRWARN_S0S1_Pos            (11)
#define I3C_ERRWARN_S0S1                (0x01U << I3C_ERRWARN_S0S1_Pos)         /*!< An S0 or S1 error occurs, and the I3C is locked from the device, waiting for the HDR to exit the mode */

#define I3C_ERRWARN_OREAD_Pos           (16)
#define I3C_ERRWARN_OREAD               (0x01U << I3C_ERRWARN_OREAD_Pos)        /*!< RDATAB and RDATAH registers are read in empty time */
#define I3C_ERRWARN_OWRITE_Pos          (17)
#define I3C_ERRWARN_OWRITE              (0x01U << I3C_ERRWARN_OWRITE_Pos)       /*!< Write data overflow: When full, the WDATAB/WDATABE and WDATAH/WDATAHE registers are written */

/**
  * @brief I3C_DMACTRL Register Bit Definition
  */
#define I3C_DMACTRL_DMAFB_Pos           (0)
#define I3C_DMACTRL_DMAFB               (0x03U << I3C_DMACTRL_DMAFB_Pos)        /*!< DMA read enable: */
#define I3C_DMACTRL_DMAFB_0             (0x00U << I3C_DMACTRL_DMAFB_Pos)        /*!< DMA disable */
#define I3C_DMACTRL_DMAFB_1             (0x01U << I3C_DMACTRL_DMAFB_Pos)        /*!< DMA is enabled for 1 frame messages and then automatically zeroed out when a STOP or START condition is detected */
#define I3C_DMACTRL_DMAFB_2             (0x02U << I3C_DMACTRL_DMAFB_Pos)        /*!< DMA is enabled until this field is set to 0 */

#define I3C_DMACTRL_DMATB_Pos           (2)
#define I3C_DMACTRL_DMATB               (0x03U << I3C_DMACTRL_DMATB_Pos)        /*!< DMA write enable: */
#define I3C_DMACTRL_DMATB_0             (0x00U << I3C_DMACTRL_DMATB_Pos)        /*!< DMA disable */
#define I3C_DMACTRL_DMATB_1             (0x01U << I3C_DMACTRL_DMATB_Pos)        /*!< DMA is enabled for 1 frame messages and then automatically zeroed out when a STOP or START condition is detected */
#define I3C_DMACTRL_DMATB_2             (0x02U << I3C_DMACTRL_DMATB_Pos)        /*!< DMA is enabled until this field is set to 0 */

#define I3C_DMACTRL_DMAWIDTH_Pos        (4)
#define I3C_DMACTRL_DMAWIDTH            (0x03U << I3C_DMACTRL_DMAWIDTH_Pos)     /*!< Bit width of data transmitted by DMA: */
#define I3C_DMACTRL_DMAWIDTH_0          (0x00U << I3C_DMACTRL_DMAWIDTH_Pos)     /*!< Byte (default) */
#define I3C_DMACTRL_DMAWIDTH_1          (0x01U << I3C_DMACTRL_DMAWIDTH_Pos)     /*!< Byte (default) */
#define I3C_DMACTRL_DMAWIDTH_2          (0x02U << I3C_DMACTRL_DMAWIDTH_Pos)     /*!< Half word (16 bits) */

/**
  * @brief I3C_DATACTRL Register Bit Definition
  */
#define I3C_DATACTRL_FLUSHTB_Pos        (0)
#define I3C_DATACTRL_FLUSHTB            (0x01U << I3C_DATACTRL_FLUSHTB_Pos)     /*!< Refresh TX FIFO */
#define I3C_DATACTRL_FLUSHFB_Pos        (1)
#define I3C_DATACTRL_FLUSHFB            (0x01U << I3C_DATACTRL_FLUSHFB_Pos)     /*!< Refresh RX FIFO */

#define I3C_DATACTRL_UNLOCK_Pos         (3)
#define I3C_DATACTRL_UNLOCK             (0x01U << I3C_DATACTRL_UNLOCK_Pos)      /*!< Write bits 7 to 4 are valid */
#define I3C_DATACTRL_TXTRIG_Pos         (4)
#define I3C_DATACTRL_TXTRIG             (0x03U << I3C_DATACTRL_TXTRIG_Pos)      /*!< TX FIFO trigger level: */
#define I3C_DATACTRL_TXTRIG_0           (0x00U << I3C_DATACTRL_TXTRIG_Pos)      /*!< Triggered when empty */
#define I3C_DATACTRL_TXTRIG_1           (0x01U << I3C_DATACTRL_TXTRIG_Pos)      /*!< Triggered when <= 1/4 full */
#define I3C_DATACTRL_TXTRIG_2           (0x02U << I3C_DATACTRL_TXTRIG_Pos)      /*!< Triggered when <= 1/2 full */
#define I3C_DATACTRL_TXTRIG_3           (0x03U << I3C_DATACTRL_TXTRIG_Pos)      /*!< Triggered when 1 or less than full */
#define I3C_DATACTRL_RXTRIG_Pos         (6)
#define I3C_DATACTRL_RXTRIG             (0x03U << I3C_DATACTRL_RXTRIG_Pos)      /*!< RX FIFO trigger level: */
#define I3C_DATACTRL_RXTRIG_0           (0x00U << I3C_DATACTRL_RXTRIG_Pos)      /*!< Triggered when empty */
#define I3C_DATACTRL_RXTRIG_1           (0x01U << I3C_DATACTRL_RXTRIG_Pos)      /*!< Triggered when >= 1/4 full */
#define I3C_DATACTRL_RXTRIG_2           (0x02U << I3C_DATACTRL_RXTRIG_Pos)      /*!< Triggered when >= 1/2 full */
#define I3C_DATACTRL_RXTRIG_3           (0x03U << I3C_DATACTRL_RXTRIG_Pos)      /*!< Triggered when >= 3/4 full */

#define I3C_DATACTRL_TXCOUNT_Pos        (16)
#define I3C_DATACTRL_TXCOUNT            (0x1FU << I3C_DATACTRL_TXCOUNT_Pos)     /*!< The number of bytes sent in the FIFO */

#define I3C_DATACTRL_RXCOUNT_Pos        (24)
#define I3C_DATACTRL_RXCOUNT            (0x1FU << I3C_DATACTRL_RXCOUNT_Pos)     /*!< The number of bytes received in the FIFO */

#define I3C_DATACTRL_TXFULL_Pos         (30)
#define I3C_DATACTRL_TXFULL             (0x01U << I3C_DATACTRL_TXFULL_Pos)      /*!< TX FIFO full/not full */

#define I3C_DATACTRL_RXEMPTY_Pos        (31)
#define I3C_DATACTRL_RXEMPTY            (0x01U << I3C_DATACTRL_RXEMPTY_Pos)     /*!< RX FIFO empty/not empty */

/**
  * @brief I3C_WDATAB Register Bit Definition
  */
#define I3C_WDATAB_DATA_Pos             (0)
#define I3C_WDATAB_DATA                 (0xFFU << I3C_WDATAB_DATA_Pos)          /*!< Bytes of data sent to the bus controller */
#define I3C_WDATAB_END_Pos              (8)
#define I3C_WDATAB_END                  (0x01U << I3C_WDATAB_END_Pos)           /*!< DATA is the final byte */

#define I3C_WDATAB_END2_Pos             (16)
#define I3C_WDATAB_END2                 (0x01U << I3C_WDATAB_END2_Pos)          /*!< DATA is the final byte 8 */

/**
  * @brief I3C_WDATABE Register Bit Definition
  */
#define I3C_WDATABE_DATA_Pos            (0)
#define I3C_WDATABE_DATA                (0xFFU << I3C_WDATABE_DATA_Pos)         /*!< The final data byte sent to the bus controller */

/**
  * @brief I3C_WDATAH Register Bit Definition
  */
#define I3C_WDATAH_DATA0_Pos            (0)
#define I3C_WDATAH_DATA0                (0xFFU << I3C_WDATAH_DATA0_Pos)         /*!< The first byte of data sent to the bus controller */

#define I3C_WDATAH_DATA1_Pos            (8)
#define I3C_WDATAH_DATA1                (0xFFU << I3C_WDATAH_DATA1_Pos)         /*!< The second byte of data sent to the bus controller */

