wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_i3c.h
#define I3C_WDATAH_END_Pos              (16)
#define I3C_WDATAH_END                  (0x01U << I3C_WDATAH_END_Pos)           /*!< DATA1 is the final byte */


/**
  * @brief I3C_WDATAHE Register Bit Definition
  */
#define I3C_WDATAHE_DATA0_Pos           (0)
#define I3C_WDATAHE_DATA0               (0xFFU << I3C_WDATAHE_DATA0_Pos)        /*!< The first byte of data sent to the bus controller */
#define I3C_WDATAHE_DATA1_Pos           (8)
#define I3C_WDATAHE_DATA1               (0xFFU << I3C_WDATAHE_DATA1_Pos)        /*!< The second (and final) data byte sent to the bus controller */

/**
  * @brief I3C_RDATAB Register Bit Definition
  */
#define I3C_RDATAB_DATA0_Pos            (0)
#define I3C_RDATAB_DATA0                (0xFFU << I3C_RDATAB_DATA0_Pos)         /*!< Read data bytes from the RX FIFO */

/**
  * @brief I3C_RDATAH Register Bit Definition
  */
#define I3C_RDATAH_LSB_Pos              (0)
#define I3C_RDATAH_LSB                  (0xFFU << I3C_RDATAH_LSB_Pos)           /*!< Read the first byte from the RX FIFO */
#define I3C_RDATAH_MSB_Pos              (8)
#define I3C_RDATAH_MSB                  (0xFFU << I3C_RDATAH_MSB_Pos)           /*!< Read the second byte from the RX FIFO */

/**
  * @brief I3C_WDATAB1 Register Bit Definition
  */
#define I3C_WDATAB1_DATA_Pos            (0)
#define I3C_WDATAB1_DATA                (0xFFU << I3C_WDATAB1_DATA_Pos)         /*!< Bytes sent to the bus controller */

/**
  * @brief I3C_CAPABILITIES2 Register Bit Definition
  */
#define I3C_CAPABILITIES2_MAPCNT_Pos    (0)
#define I3C_CAPABILITIES2_MAPCNT        (0x0FU << I3C_CAPABILITIES2_MAPCNT_Pos) /*!< Indicates the number of supported address mappings */
#define I3C_CAPABILITIES2_I2C10B_Pos    (4)
#define I3C_CAPABILITIES2_I2C10B        (0x01U << I3C_CAPABILITIES2_I2C10B_Pos) /*!< Supports I2C 10-bit addresses */
#define I3C_CAPABILITIES2_I2CRST_Pos    (5)
#define I3C_CAPABILITIES2_I2CRST        (0x01U << I3C_CAPABILITIES2_I2CRST_Pos) /*!< Supports the reset of I2C applications */
#define I3C_CAPABILITIES2_I2CDEVID_Pos  (6)
#define I3C_CAPABILITIES2_I2CDEVID      (0x01U << I3C_CAPABILITIES2_I2CDEVID_Pos) /*!< Supports the I2C device ID */
#define I3C_CAPABILITIES2_IBIEXT_Pos    (8)
#define I3C_CAPABILITIES2_IBIEXT        (0x01U << I3C_CAPABILITIES2_IBIEXT_Pos) /*!< supports IBI extended data */
#define I3C_CAPABILITIES2_IBIFIFO_Pos   (9)
#define I3C_CAPABILITIES2_IBIFIFO       (0x01U << I3C_CAPABILITIES2_IBIFIFO_Pos)/*!< Support level 2 FIFO for IBI extended data */

#define I3C_CAPABILITIES2_V1_1_Pos      (16)
#define I3C_CAPABILITIES2_V1_1          (0x01U << I3C_CAPABILITIES2_V1_1_Pos)   /*!< Support GETCAPS CCC (I3C protocol v1.1) */
#define I3C_CAPABILITIES2_SLVRST_Pos    (17)
#define I3C_CAPABILITIES2_SLVRST        (0x01U << I3C_CAPABILITIES2_SLVRST_Pos) /*!< Support reset from device (I3C protocol v1.1) */
#define I3C_CAPABILITIES2_GROUP_Pos     (18)
#define I3C_CAPABILITIES2_GROUP         (0x03U << I3C_CAPABILITIES2_GROUP_Pos)  /*!< Number of GROUP addresses supported */

#define I3C_CAPABILITIES2_AASA_Pos      (21)
#define I3C_CAPABILITIES2_AASA          (0x01U << I3C_CAPABILITIES2_AASA_Pos)   /*!< SETAASA is supported */
#define I3C_CAPABILITIES2_SSTSUB_Pos    (22)
#define I3C_CAPABILITIES2_SSTSUB        (0x01U << I3C_CAPABILITIES2_SSTSUB_Pos) /*!< Support subscriber from device to device */
#define I3C_CAPABILITIES2_SSTWR_Pos     (23)
#define I3C_CAPABILITIES2_SSTWR         (0x01U << I3C_CAPABILITIES2_SSTWR_Pos)  /*!< Supports write from device to device */

/**
  * @brief I3C_CAPABILITIES Register Bit Definition
  */
#define I3C_CAPABILITIES_IDENA_Pos      (0)
#define I3C_CAPABILITIES_IDENA          (0x03U << I3C_CAPABILITIES_IDENA_Pos)     /*!< Processing method of 48-bit ID */
#define I3C_CAPABILITIES_IDREG_Pos      (2)
#define I3C_CAPABILITIES_IDREG          (0x0FU << I3C_CAPABILITIES_IDREG_Pos)     /*!< Select the register configuration ID information field */
#define I3C_CAPABILITIES_HDRSUPP_Pos    (6)
#define I3C_CAPABILITIES_HDRSUPP        (0x07U << I3C_CAPABILITIES_HDRSUPP_Pos)   /*!< Whether to support HDR and its type */
#define I3C_CAPABILITIES_MASTER_Pos     (9)
#define I3C_CAPABILITIES_MASTER         (0x01U << I3C_CAPABILITIES_MASTER_Pos)    /*!< Support the master function */
#define I3C_CAPABILITIES_SADDR_Pos      (10)
#define I3C_CAPABILITIES_SADDR          (0x03U << I3C_CAPABILITIES_SADDR_Pos)     /*!< Static address */

#define I3C_CAPABILITIES_CCCHANDLE_Pos  (12)
#define I3C_CAPABILITIES_CCCHANDLE      (0x0FU << I3C_CAPABILITIES_CCCHANDLE_Pos) /*!< Indicates that the CCC is handled by I3C from a device or by an application */

#define I3C_CAPABILITIES_IBI_MR_HJ_Pos  (16)
#define I3C_CAPABILITIES_IBI_MR_HJ      (0x1FU << I3C_CAPABILITIES_IBI_MR_HJ_Pos) /*!< Supported event types: */
#define I3C_CAPABILITIES_TIMECTRL_Pos   (21)
#define I3C_CAPABILITIES_TIMECTRL       (0x01U << I3C_CAPABILITIES_TIMECTRL_Pos)  /*!< At least one time control mode is supported */
#define I3C_CAPABILITIES_EXTFIFO_Pos    (23)
#define I3C_CAPABILITIES_EXTFIFO        (0x07U << I3C_CAPABILITIES_EXTFIFO_Pos)   /*!< Supports external FIFO */
#define I3C_CAPABILITIES_FIFOTX_Pos     (26)
#define I3C_CAPABILITIES_FIFOTX         (0x03U << I3C_CAPABILITIES_FIFOTX_Pos)    /*!< Supports TX FIFO and its size */
#define I3C_CAPABILITIES_FIFORX_Pos     (28)
#define I3C_CAPABILITIES_FIFORX         (0x03U << I3C_CAPABILITIES_FIFORX_Pos)    /*!< Whether RX FIFO is supported and its size */

#define I3C_CAPABILITIES_INT_Pos        (30)
#define I3C_CAPABILITIES_INT            (0x03U << I3C_CAPABILITIES_INT_Pos)       /*!< Support interrupt */
#define I3C_CAPABILITIES_DMA_Pos        (31)
#define I3C_CAPABILITIES_DMA            (0x03U << I3C_CAPABILITIES_DMA_Pos)       /*!< Support DMA */

/**
  * @brief I3C_DYNADDR Register Bit Definition
  */
#define I3C_DYNADDR_DAVALID_Pos         (0)
#define I3C_DYNADDR_DAVALID             (0x01U << I3C_DYNADDR_DAVALID_Pos)      /*!< A dynamic address was assigned when DADDR was read or set */
#define I3C_DYNADDR_DADDR_Pos           (1)
#define I3C_DYNADDR_DADDR               (0x7FU << I3C_DYNADDR_DADDR_Pos)        /*!< If DAVALID is 1, the field is the assigned dynamic address */
#define I3C_DYNADDR_DCAUSE_Pos          (8)
#define I3C_DYNADDR_DCAUSE              (0x07U << I3C_DYNADDR_DCAUSE_Pos)       /*!< Indicates the cause of the dynamic address change */

#define I3C_DYNADDR_KEY_Pos             (16)
#define I3C_DYNADDR_KEY                 (0xFFFFU << I3C_DYNADDR_KEY_Pos)        /*!< Mapping Address Setting */

/**
  * @brief I3C_MAXLIMITS Register Bit Definition
  */
#define I3C_MAXLIMITS_MAXRD_Pos         (0)
#define I3C_MAXLIMITS_MAXRD             (0xFFFU << I3C_MAXLIMITS_MAXRD_Pos)     /*!< Maximum number of bytes read. The value ranges from 16 to 4095 */
#define I3C_MAXLIMITS_MAXWR_Pos         (16)
#define I3C_MAXLIMITS_MAXWR             (0xFFFU << I3C_MAXLIMITS_MAXWR_Pos)     /*!< Maximum number of bytes written. The value ranges from 8 to 4095 */

/**
  * @brief I3C_PARTNO Register Bit Definition
  */
#define I3C_PARTNO_Pos                  (0)
#define I3C_PARTNO                      (0xFFFFFFFFU << I3C_PARTNO_Pos)         /*!< Set Part Number. 0 is usually invalid */

/**
  * @brief I3C_IDEXT Register Bit Definition
  */
#define I3C_IDEXT_DCR_Pos               (8)
#define I3C_IDEXT_DCR                   (0xFFU << I3C_IDEXT_DCR_Pos)            /*!< Configure DCR (Device type) */
#define I3C_IDEXT_BCR_Pos               (16)
#define I3C_IDEXT_BCR                   (0xFFU << I3C_IDEXT_BCR_Pos)            /*!< Configure BCR (bus capability) */

/**
  * @brief I3C_VENDORID Register Bit Definition
  */
#define I3C_VENDORID_VID_Pos            (0)
#define I3C_VENDORID_VID                (0x7FFFU << I3C_VENDORID_VID_Pos)       /*!< Configure 15 bit MIPI Vendor ID */

/**
  * @brief I3C_DIV Register Bit Definition
  */
#define I3C_DIV_Pos                     (0)
#define I3C_DIV                         (0xFFU << I3C_DIV_Pos)                  /*!< CLK_SLOW Frequency division */

/**
  * @brief I3C_SPKLEN Register Bit Definition
  */
#define I3C_SPKLEN_SPKLEN_Pos           (0)
#define I3C_SPKLEN_SPKLEN               (0xFFU << I3C_SPKLEN_SPKLEN_Pos)        /*!< Configure digital filter at the SCL and SDA inputs */

#define I3C_SPKLEN_FLT_EN_Pos           (16)
#define I3C_SPKLEN_FLT_EN               (0x01U << I3C_SPKLEN_FLT_EN_Pos)        /*!< Filter enable */

/**
  * @brief I3C_DYNADDR Register Bit Definition
  */
#define I3C_DYNADDR_DAVALID_Pos         (0)
#define I3C_DYNADDR_DAVALID             (0x01U << I3C_DYNADDR_DAVALID_Pos)      /*!< A dynamic address was assigned when DADDR was read or set */
#define I3C_DYNADDR_DADDR_Pos           (1)
#define I3C_DYNADDR_DADDR               (0x7FU << I3C_DYNADDR_DADDR_Pos)        /*!< The dynamic address to be assigned */
#define I3C_DYNADDR_MAPIDX_DCAUSE_Pos   (8)
#define I3C_DYNADDR_MAPIDX_DCAUSE       (0x0FU << I3C_DYNADDR_MAPIDX_DCAUSE_Pos)  /*!< MAPIDX specifies the mapping address index, and DCAUSE indicates the cause of the primary dynamic address change */
#define I3C_DYNADDR_MAPSA_Pos           (12)
#define I3C_DYNADDR_MAPSA               (0x01U << I3C_DYNADDR_MAPSA_Pos)        /*!< If MAPIDX is a non-zero value, this bit indicates that the current DADDR value is a static address */

#define I3C_DYNADDR_KEY_Pos             (16)
#define I3C_DYNADDR_KEY                 (0xFFFFU << I3C_DYNADDR_KEY_Pos)        /*!< Mapping Address Setting */



/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
